#MasterSourceFile run.tcl
set_fml_appmode FPV
1
set design traffic
traffic
read_file -top $design -format sverilog -sva -vcs {-f ../design/filelist +define+INLINE_SVA ../sva/traffic.sva ../sva/bind_traffic.sva}
Info: Invoking New SVA Compiler Instrument...
Info: SVAC-NC Start
Info: SVAC-NC Finished
Info: Invoking Simon...
Info: Simon VCS Start
=======================================================
VCS CPU Time(s)     :0.11
SIMON CPU Time(s)   :0.08
SIMON Total Time(s) :0.03
Peak Memory(MB)     :341
=======================================================
Info: Simon VCS Finished
Info: Simon call complete 
Info: Exiting after Simon Analysis 
Verdi KDB elaboration done and the database successfully generated: 0 error(s), 0 warning(s)
[Info] DB_COPT045: Vcs analyzer task has finished.
[Info] PROP_I_COLLECT: Collecting Source Properties from the view:traffic.
# Gate Counts 
Number of Flat Instances = 609
Number of Operator = 609
Number of Libcells = 0
Number of Black-Box Instances = 0
1
# analyze -format sverilog -vcs {-f ../design/filelist +define+INLINE_SVA ../sva/traffic.sva ../sva/bind_traffic.sva}
# elaborate $design -sva 
create_clock clk -period 100
1
create_reset rst -sense high
1
sim_run -stable
[Info] SIM_I_CREATE: Create Simulation Model.
1
sim_save_reset
1
1
1
[Info] Opening Complexity View...
#check_fv
[Error] LICENSE_CHECKOUT_ERROR: Unable to checkout license for VC Formal.
Error: 0
	Use error_info for more info. (CMD-013)
